lec09-1/app/controllers/main_controller.rb

  def create
    u = User.where(username: params[:username]).first
---
SELECT "users".* FROM "users" WHERE "users"."username" = ? ORDER BY "users"."id" ASC LIMIT ?  [["username", "dwq"], ["LIMIT", 1]]