lec09-1/app/views/students/edit_score.html.erb

SELECT "scores".* FROM "scores" WHERE "scores"."student_id" = ?  [["student_id", 1]]
---
    <tbody>
        <% @student.scores.each do |score| %>