hw03/app/controllers/main_controller.rb

        @maxSub = @subject_array[i]
      end
      # save in database
      @allSubjects = Subject.where(name: @subject_array[i])
      if(@allSubjects.empty?)
        Subject.create(name: @subject_array[i], score: @score_array[i])
---
SELECT "subjects".* FROM "subjects" WHERE "subjects"."name" = ?  [["name", "cal"]]
SELECT 1 AS one FROM "subjects" WHERE "subjects"."name" = ? LIMIT ?  [["name", "cal"], ["LIMIT", 1]]
INSERT INTO "subjects" ("name", "score", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "cal"], ["score", 20], ["created_at", "2022-09-11 15:23:38.248604"], ["updated_at", "2022-09-11 15:23:38.248604"]]

  def showList
    @allSubjects = Subject.all
---
SELECT "subjects".* FROM "subjects"

  def deleteSubject
    @id = params[:id].to_i
    s = Subject.find_by(id: @id)
    s.destroy
---
SELECT "subjects".* FROM "subjects" WHERE "subjects"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
DELETE FROM "subjects" WHERE "subjects"."id" = ?  [["id", 5]]

  def editSubject
    @id = params[:id].to_i
    @s = Subject.find_by(id: @id)
---
SELECT "subjects".* FROM "subjects" WHERE "subjects"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]

  def saveSubject
    @id = params[:id].to_i
    @name = params[:name]
    @score = params[:score].to_i
    s = Subject.find_by(id: @id)
    s.update(name: @name, score: @score)
---
SELECT "subjects".* FROM "subjects" WHERE "subjects"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
UPDATE "subjects" SET "score" = ?, "updated_at" = ? WHERE "subjects"."id" = ?  [["score", 20], ["updated_at", "2022-09-12 10:13:51.468691"], ["id", 8]]