lec06-1/app/controllers/students_controller.rb

  def create
    @student = Student.new(student_params)

    respond_to do |format|
      if @student.save
---
INSERT INTO "students" ("name", "phone", "student_no", "dob", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "Pisit"], ["phone", "123456"], ["student_no", "123456"], ["dob", nil], ["created_at", "2022-09-15 08:04:08.736816"], ["updated_at", "2022-09-15 08:04:08.736816"]]

  def update
    respond_to do |format|
      if @student.update(student_params)
---
UPDATE "students" SET "dob" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["dob", "2022-09-06"], ["updated_at", "2022-09-15 08:04:27.134443"], ["id", 1]]