lec08-1/app/controllers/scores_controller.rb

INSERT INTO "scores" ("subject", "point", "grade", "student_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["subject", "uu"], ["point", 50], ["grade", "C"], ["student_id", 1], ["created_at", "2022-10-19 09:13:35.702498"], ["updated_at", "2022-10-19 09:13:35.702498"]]
---
  def create
    @score = Score.new(score_params)

    respond_to do |format|
      if @score.save

UPDATE "scores" SET "point" = ?, "updated_at" = ? WHERE "scores"."id" = ?  [["point", 98], ["updated_at", "2022-10-19 09:12:18.978245"], ["id", 1]]
---
  def update
    session[:from_edit_score] = params[:score][:from_edit_score]
    #pp 'aaa'
    #pp session[:from_edit_score]
    respond_to do |format|
      if @score.update(score_params)

DELETE FROM "scores" WHERE "scores"."id" = ?  [["id", 2]]
---
  def destroy
    @score.destroy

SELECT "scores".* FROM "scores" WHERE "scores"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_score
      @score = Score.find(params[:id])