lec08-1/app/controllers/students_controller.rb

INSERT INTO "students" ("name", "dob", "student_no", "class_year", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "JoJo"], ["dob", "2022-09-07"], ["student_no", "21078"], ["class_year", 1], ["created_at", "2022-09-22 07:34:03.471355"], ["updated_at", "2022-09-22 07:34:03.471355"]]
---
  def create
    @student = Student.new(student_params)

    respond_to do |format|
      if @student.save