lec10-1/app/controllers/items_controller.rb

INSERT INTO "items" ("user_id", "price", "name", "stock", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["user_id", 1], ["price", 20.0], ["name", "koko"], ["stock", 2], ["created_at", "2022-10-28 13:40:00.979378"], ["updated_at", "2022-10-28 13:40:00.979378"]]
---
  def create
    @item = Item.new(item_params)

    respond_to do |format|
      if @item.save

UPDATE "items" SET "user_id" = ?, "stock" = ?, "updated_at" = ? WHERE "items"."id" = ?  [["user_id", 2], ["stock", 0], ["updated_at", "2022-10-28 14:50:40.128534"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @item.update(item_params)