lec10-1/app/controllers/main_controller.rb

  def create
    u = User.where(login: params[:login]).first
---
SELECT "users".* FROM "users" WHERE "users"."login" = ? ORDER BY "users"."id" ASC LIMIT ?  [["login", "root"], ["LIMIT", 1]]

  def user_Items
    @login_user_id = session[:login_user_id].to_i
    @user = User.where(id: @login_user_id).first
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 0], ["LIMIT", 1]]

  def user_Item_delete
    @item = Item.find(params[:id])
    @item.destroy
---
SELECT "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
DELETE FROM "items" WHERE "items"."id" = ?  [["id", 3]]

  def show_shop
    @user = User.where(id: params[:id].to_i).first
    if(session[:logged_in] == true)
      @user_login = User.where(id: session[:login_user_id].to_i).first
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def buy_item
    @item = Item.find(params[:item_id])
    @buyer_id = session[:login_user_id].to_i
    @buyer = User.where(id: @buyer_id).first
    if(@item.stock <= 0)
      redirect_to '/shop/' + params[:shop_user_id].to_s + '?warning=true'
    else
      @item.stock -= 1
      @item.save
      Inventory.create(user_id: @buyer_id, item_id: @item.id, price: @item.price, timestamp: DateTime.current)
---
SELECT "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "items" SET "stock" = ?, "updated_at" = ? WHERE "items"."id" = ?  [["stock", 1], ["updated_at", "2022-10-28 15:05:08.465539"], ["id", 6]]
INSERT INTO "inventories" ("user_id", "item_id", "price", "timestamp", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["user_id", 2], ["item_id", 7], ["price", 20.0], ["timestamp", "2022-10-28 15:14:02.825567"], ["created_at", "2022-10-28 15:14:02.837393"], ["updated_at", "2022-10-28 15:14:02.837393"]]

  def show_inventory
    @login_user_id = session[:login_user_id].to_i
    @user = User.where(id: @login_user_id).first
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 2], ["LIMIT", 1]]