lec10-1/app/controllers/main_controller.rb

UPDATE "items" SET "user_id" = ?, "updated_at" = ? WHERE "items"."id" = ?  [["user_id", nil], ["updated_at", "2022-10-31 13:58:37.618524"], ["id", 7]]
---
  def user_Item_delete
    @item = Item.find(params[:id])
    @item.user_id = nil
    @item.save