lec07-1/app/controllers/students_controller.rb

  def create
    @student = Student.new(student_params)

    respond_to do |format|
      if @student.save
---
INSERT INTO "students" ("name", "dob", "student_no", "class_year", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "JoJo"], ["dob", "2022-09-07"], ["student_no", "21078"], ["class_year", 1], ["created_at", "2022-09-22 07:34:03.471355"], ["updated_at", "2022-09-22 07:34:03.471355"]]

  def edit_score
    @id = params[:id].to_i
    @student = Student.find_by(id: @id)
---
SELECT "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]