lec10-1/app/views/main/show_inventory.html.erb

SELECT "inventories".* FROM "inventories" WHERE "inventories"."user_id" = ?  [["user_id", 2]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "items".* FROM "items" WHERE "items"."id" = ? ORDER BY "items"."id" ASC LIMIT ?  [["id", 7], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    <tbody>
        <% @user.inventories.each do |inventory| %>
            <tr>
                <td><%= Item.find(inventory.item_id).user_id %></td>
                <td><%= User.find(Item.find(inventory.item_id).user_id).name %></td>
                <td><%= inventory.item_id %></td>
                <td><%= Item.find(inventory.item_id).name %></td>