lec10-1/app/views/main/show_shop.html.erb

    <tbody>
        <% @user.items.each do |item| %>
---
SELECT "items".* FROM "items" WHERE "items"."user_id" = ?  [["user_id", 1]]