lec08-1/app/views/students/edit_score.html.erb

    <th>Delete</th>
    <% @student.scores.each do |score| %>
---
SELECT "scores".* FROM "scores" WHERE "scores"."student_id" = ?  [["student_id", 1]]